# Модуль 20. Фреймворки. Часть 9

# В рамках этого домашнего задания вам нужно продолжить работу
# над веб-приложением «Библиотека» из практического задания.

# Задание 1
# Добавьте к вашему приложению возможность добавления информации
# о книгах, читателях и т. д.

# Задание 2
# Добавьте к вашему приложению возможность редактирования информации
# о книгах, читателях и т. д.

# Задание 3
# Добавьте к вашему приложению возможность удаления информации
# о книгах, читателях и т. д.

# Задание 4
# Добавьте к вашему приложению дополнительные механизмы аутентификации
# и авторизации. Создайте группу для библиотекарей.
# Эта группа может просматривать информацию о книгах, читателях и т. д.

# Задание 5
# Добавьте к вашему приложению дополнительные механизмы аутентификации
# и авторизации. Создайте группу для администраторов. Эта группа может выпол-
# нять любые действия: просмотр, добавление, удаление, редактирование информации.
