# Модуль 20. Фреймворки. Часть 5.
# Задание 1
# Создайте форму для входа в веб-сайт. Пользователь должен ввести
# логин и пароль. Сделайте проверку на два вида пользователей:
# ■ Администраторы;
# ■ Пользователи.
# Если пользователь вводит существующий логин и пароль,
# веб-сайт должен вывести на экран приветствие с указанием уровня доступа.
# Если такого пользователя нет, вывести информацию о неправильных
# входных параметрах.

# Задание 2
# Пользователь вводит в форму три числа (можно использовать три текстовых
# поля или вводить три числа через пробел в одно текстовое поле).
# С помощью радиокнопок пользователь выбирает, что он хочет найти:
# ■ Минимум из трёх;
# ■ Максимум из трёх;
# ■ Среднеарифметическое из трёх.
# После нажатия на кнопку типа Submit нужно отобразить результат вычислений.

# Задание 3
# Создайте форму для регистрации пользователя в интернет-магазине.
# Пользователь должен ввести такие данные:
# ■ Имя;
# ■ Фамилия;
# ■ Возраст;
# ■ Email;
# ■ Пол;
# ■ Адрес для доставки товара.
# Отдельно в форме предусмотрите чек-бокс для подписки на новости
# вашего интернет-магазина. Надпись возлеэтого элемента может выглядеть
# следующим образом: «Хотите ли подписаться на новости нашего интернет-магазина?»
# После получения данных приложение должно отобразить их в отформатированном виде.

# Задание 4
# Пользователь вводит в текстовое поле в форме информацию о годе.
# Приложение должно отобразить дату дня программиста в указанном годе.
# Например:
# Пользователь ввёл: 2021.
# Результат работы: 13 сентября (понедельник).