# Модуль 20. Фреймворки. Часть 8
# В рамках этого домашнего задания вам нужно продолжить работу над веб-приложением о продажах из
# практического задания.

# Задание 1
# Добавьте к приложению возможность редактирования инф-ию о покупателях, продавцах, продажах, товарах.

# Задание 2
# Добавьте к вашему приложению возможность удаления
# информации о покупателях, продавцах, продажах, товарах.

# Задание 3
# Добавьте к вашему приложению возможность построения отчётов. Вам необходимо реализовать такие отчёты:
# ■ Отображение всех покупателей заданного продавца;
# ■ Отображение всех продаж на заданную дату;
# ■ Отображение всех продавцов, которые продали за данный товар;
# ■ Отображение всех покупателей, которые купили за данный товар;
# ■ Отображение общей суммы продаж в заданный день.

# Задание 4
# Добавьте к вашему приложению возможность построения отчётов. Вам необходимо реализовать такие отчёты:
# ■ Отобразить название самого продаваемого товара;
# ■ Отобразить лучшего продавца. Критерий определения: максимальная сумма продаж;
# ■ Отобразить лучшего покупателя. Критерий определения: максимальная сумма покупок;
# ■ Отобразить название самого продаваемого товара за указанный промежуток времени;
# ■ Отобразить лучшего продавца. Критерий определения: максимальная сумма продаж за указанный промежуток времени;
# ■ Отобразить лучшего покупателя. Критерий определения: максимальная сумма покупок за указанный
# промежуток времени.
