# Модуль 7. Сортировка и поиск.
# Тема: Сортировка и поиск. Часть 3

# Задание 1
# Есть четыре списка целых. Необходимо их объединить в пятом списке.
# Полученный результат в зависимости от выбора пользователя,
# отсортировать по убыванию или возрастанию.
# Найти значение, введенное пользователем, с использованием линейного поиска.

# Задание 2
# Есть четыре списка целых. Необходимо объединить в пятом списке только те элементы,
# которые уникальны для каждого списка.
# Полученный результат в зависимости от выбора пользователя отсортировать по убыванию
# или возрастанию. Найти значение, введенное пользователем,
# с использованием бинарного поиска.