# Модуль 7. Сортировка и поиск.
# Тема: Сортировка и поиск. Часть 2

# Задание 1
# Написать программу «справочник». Создать два списка целых.
# Один список хранит идентификационные коды, второй — телефонные номера.
# Реализовать меню для пользователя:
# ■ Отсортировать по идентификационным кодам;
# ■ Отсортировать по номерам телефона;
# ■ Вывести список пользователей с кодами и телефонами;
# ■ Выход.

# Задание 2
# Написать программу «книги». Создать два списка название и год выпуска.
# Реализовать меню для пользователя:
# ■ Отсортировать по названию книг;
# ■ Отсортировать по годам выпуска;
# ■ Вывести список книг с названиями и годами выпуска;
# ■ Выход.