# Модуль 20. Фреймворки
# Тема: Фреймворки. Часть 1
# Задание 1
# Установите и настройте Django на вашем локальном
# компьютере.
# Задание 2
# Создайте начальное, базовое приложение с помощью
# Django.
# Задание 3
# Настройте приложение из второго задания, чтобы
# оно выводило в браузер текущую дату и время.
# Задание 4
# Создайте веб-приложение, отображающее таблицу
# умножения от 1 до 10.
# Задание 5
# Создайте веб-приложение, отображающее дату дня
# программиста в текущем году. День программиста —
# 256-й день года.

# создаем новый репозиторий на GITHAB
# клонирум его в новый проект на ph, виртуальное окружение!
# устанавливаем джанго в ph командой в терминале:
# pip install django - и проверяем установленную версию
# создаем новый проект - django-admin startproject my_project_dj .
# создаем приложение в проекте - python manage.py startapp myapp
# где - myapp - название приложения и соответственно папки в проекте
# регистрируем приложение: - в папке project в файле settings.py
# INSTALLED_APPS = [ дописываем последней строкой -"myapp", - имя прилож.
