# Модуль 20. Фреймворки. Часть 10

# В рамках этого практического задания вам нужно будет использовать
# внешний ресурс https://swapi.dev/. Он посвящен серии
# фильмов «Звёздные войны». Этот сайт предоставляет API
# для получения информации о фильмах серии, героях, планетах и т. д.

# Задание 1
# Используя API отобразите названия всех фильмов серии.
# При клике на конкретный фильм нужно отображать информацию о нём.

# Задание 2
# Используя API отобразите имена главных героев серии.
# При клике на конкретном герое нужно отображать информацию о нём.

# Задание 3
# Используя API отобразите названия планет.При клике на конкретной
# планете нужно отображать информацию о ней.

# Задание 4
# Используя API отобразите названия кораблей. При клике на
# конкретный корабль нужно отображать информацию о нём.
