# Модуль 20. Фреймворки. Часть 10

# В рамках этого практического задания вам нужно будет создавать
# веб-сервисы, предоставляющие доступ к своей функциональности через REST API.

# Задание 1
# Создайте веб-сервис, который генерирует предсказание
# (аналог печенья с предсказаниями)

# Задание 2
# Создайте веб-сервис, которые будет генерировать случайные числа.
# Требуется создать такую функциональность:
# ■ Генерация случайного числа;
# ■ Генерация случайного числа в диапазоне;
# ■ Генерация набора случайных чисел.

# Задание 3
# Создайте веб-сервис, который будет возвращать текст стиха.
# Требуется создать следующую функциональность:
# ■ Случайный стих;
# ■ Случайный стих автора;
# ■ Случайный стих по тематике (любовь, творчество, жизнь и т. д.).

# Задание 4
# К сервису из третьего задания нужно добавить функциональность:
# ■ Названия всех стихов автора;
# ■ Список всех авторов;
# ■ Список всех тематик;
# ■ Названия всех стихов по указанной тематике.

