# Модуль 8. Кортежи, множества, словари
# Тема: Кортежи, множества, словари. Часть 2

# Задание 1
# Создайте программу, хранящую информацию о вели-
# ких баскетболистах. Нужно хранить ФИО баскетболиста и
# его рост. Требуется реализовать возможность добавления,
# удаления, поиска, замены данных. Используйте словарь
# для хранения информации.

# Задание 2
# Создайте программу «Англо-французский словарь».
# Нужно хранить слово на английском языке и его перевод
# на французский. Требуется реализовать возможность до-
# бавления, удаления, поиска, замены данных. Используйте
# словарь для хранения информации.

# Задание 3
# Создайте программу «Фирма». Нужно хранить ин-
# формацию о человеке: ФИО, телефон, рабочий email,
# название должности, номер кабинета, skype. Требуется
# реализовать возможность добавления, удаления, поис-
# ка, замены данных. Используйте словарь для хранения
# информации.

# Задание 4
# Создайте программу «Книжная коллекция». Нужно
# хранить информацию о книгах: автор, название книги,
# жанр, год выпуска, количество страниц, издательство.
# Требуется реализовать возможность добавления, удале-
# ния, поиска, замены данных. Используйте словарь для
# хранения информации.
