# Модуль 20. Фреймворки. Часть 12

# В этом домашнем задании вы продолжите работу над
# проектом «Новостной портал города» из практического задания.

# Задание
# Вам нужно добавить к проекту функциональность
# административной части:
# ■ Создайте группу/роль для администрирования портала.
# В неё должны входить несколько пользователей;
# ■ Администратор может:
# • Публиковать новости и статьи,
# • Удалять материалы,
# • Редактировать материалы,
# • Добавлять пользователей,
# • Удалять пользователей,
# • Банить пользователей на какой-то срок:
# День,
# Неделя,
# Месяц,
# Навсегда,
# • Удалять комментарии пользователей;

# ■ Администратор может:
# • Менять цвет фона проекта,
# • Менять цвет шрифта,
# • Изменять размер шрифта;
# ■ Администратор может просматривать статистику:

# • Рейтинг статей по количеству просмотров,
# • Рейтинг статей по количеству комментариев,
# • Рейтинг статей по количеству сохранений для дальнейшего прочтения.

